src/CF/InformationRegisters/СкидкиПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СкидкиПериода</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/СкидкиПериода/Forms/СозданиеУстановкиСкидкиДляПовторяющихсяПериодов/Ext/Form/Module.bsl
// sza150630-2255

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли;
	
	ПериодДействия.ДатаНачала 	 = ДатаНачала;
	ПериодДействия.ДатаОкончания = ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	
	ДатаНачала 	  = ПериодДействия.ДатаНачала;
	ДатаОкончания = ПериодДействия.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если ДлительностьЧисло = 0 Тогда
		ДлительностьЧисло = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002355", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
	ДатаНачала = ОбщийМодульСервисСервер.ПользователяТекущаяДата();	
																   КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПовторыПериодовСкидки(Команда)
	
	Если УстановитьПовторыПериодовСкидкиНаСервере() Тогда
		Закрыть();
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Недостаточно данных!"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   УстановитьПовторыПериодовСкидкиНаСервере()
	
	Если ДатаНачала = '00010101'
		ИЛИ ДатаОкончания = '00010101'
		ИЛИ ПустаяСтрока(ДлительностьЧего)
		ИЛИ ПустаяСтрока(ПовторятьЧего)
		ИЛИ ПовторятьЧисло = 0
		ИЛИ ДлительностьЧисло = 0 Тогда
		
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	ДатаОперации = ДатаНачала;
	
	Пока ДатаОперации < ДатаОкончания Цикл
		
		ДатаНачалаОперации = ДатаОперации;
		ДатаОкончанияОперации = ДатаНачалаОперации;
		
		Если ДлительностьЧего = "Дней" Тогда
			ДатаНачалаОперации = НачалоДня(ДатаНачалаОперации);
			ДатаОкончанияОперации = КонецДня(ДатаОперации + 3600 * 24 * ДлительностьЧисло);
		ИначеЕсли ДлительностьЧего = "Минут" Тогда
			ДатаОкончанияОперации = ДатаОперации + 60 * ДлительностьЧисло;
		ИначеЕсли ДлительностьЧего = "Часов" Тогда
			ДатаОкончанияОперации = ДатаОперации + 3600 * ДлительностьЧисло;			
		ИначеЕсли ДлительностьЧего = "Месяцев" Тогда
			ДатаОкончанияОперации = ДатаОперации + 3600 * 24 * 30.43685 * ДлительностьЧисло;
		ИначеЕсли ДлительностьЧего = "Лет" Тогда
			ДатаОкончанияОперации = ДатаОперации + 2629743.84 * ДлительностьЧисло;
		ИначеЕсли ДлительностьЧего = "Секунд" Тогда
			ДатаОкончанияОперации = ДатаОперации + ДлительностьЧисло;
		ИначеЕсли ДлительностьЧего = "Недель" Тогда
			ДатаОкончанияОперации = ДатаОперации + 3600 * 24 * 7 * ДлительностьЧисло;
		ИначеЕсли ДлительностьЧего = "Суток" Тогда
			ДатаОкончанияОперации = ДатаОперации + 3600 * 24 * ДлительностьЧисло;
		КонецЕсли;
		
		СкидкаПериода = РегистрыСведений.СкидкиПериода.СоздатьМенеджерЗаписи();
		СкидкаПериода.Активность 			= ИСТИНА;
		СкидкаПериода.Комментарий  			= Комментарий;
		СкидкаПериода.НоменклатурнаяГруппа  = НоменклатурнаяГруппа;
		СкидкаПериода.Период				= ДатаНачалаОперации;
		СкидкаПериода.Скидка				= Скидка;
		СкидкаПериода.Склад					= Склад;
		СкидкаПериода.Записать(ИСТИНА);
		
		СкидкаПериода = РегистрыСведений.СкидкиПериода.СоздатьМенеджерЗаписи();
		СкидкаПериода.Активность 			= ИСТИНА;
		СкидкаПериода.Комментарий  			= Комментарий;
		СкидкаПериода.НоменклатурнаяГруппа  = НоменклатурнаяГруппа;
		СкидкаПериода.Период				= ДатаОкончанияОперации;
		СкидкаПериода.Скидка				= ЗначениеПоОкончанию;
		СкидкаПериода.Склад					= Склад;
		СкидкаПериода.Записать(ИСТИНА);
		
		Если ПовторятьЧего = "Дней" Тогда
			ДатаОперации = ДатаОперации + 3600 * 24 * ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Минут" Тогда
			ДатаОперации = ДатаОперации + 60 * ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Часов" Тогда
			ДатаОперации = ДатаОперации + 3600 * ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Месяцев" Тогда
			ДатаОперации = ДатаОперации + 3600 * 24 * 30.43685 * ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Лет" Тогда
			ДатаОперации = ДатаОперации + 2629743.84 * ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Секунд" Тогда
			ДатаОперации = ДатаОперации + ПовторятьЧисло;
		ИначеЕсли ПовторятьЧего = "Недель" Тогда
			ДатаОперации = ДатаОперации + 3600 * 24 * 7 * ПовторятьЧисло;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИСТИНА;
	
КонецФункции
